; domain
(define 
	(domain world-of-blocks)
	(:requirements :adl) 
	(:predicates
		(na ?na ?pod)
		(na-ziemi ?paczka)
		(arm ?paczka)
	)
	
	;get from the floor
	(:action podnies-z-ziemi
		:parameters (?paczka)
		:precondition
		(and
			(not(exists (?x) (arm ?x)))
			(na-ziemi ?paczka)
			(not(exists (?x) (na ?x ?paczka)))
		)
		:effect
		(and
			(arm ?paczka)
			(not(na-ziemi ?paczka))
		)
	)
	
	;get from the box
	(:action podnies-z-paczki
		:parameters (?paczka ?z)
		:precondition
		(and
			(not(exists (?x) (arm ?x)))
			(not(exists (?x) (na ?x ?paczka)))
			(na ?paczka ?z)
			(not(= ?paczka ?z))
		)
		:effect
		(and
			(not(na ?paczka ?z))
			(arm ?paczka)
		)	
	)
	
	;drop on the floor
	(:action opusc-na-ziemie
		:parameters (?paczka)
		:precondition
		(and
			(arm ?paczka)
		)
		:effect
		(and
			(na-ziemi ?paczka)
			(not(arm ?paczka))
		)
	)
	
	;drop on the another block
	(:action opusc-na-paczke
		:parameters(?paczka ?na)
		:precondition
		(and
			(arm ?paczka)
			(not(= ?paczka ?na))
			(not (arm ?na))
			(not(exists (?x) (na ?x ?na)))
		)
		:effect
		(and
			(not(arm ?paczka))
			(na ?paczka ?na)
		)
	)
)

; problem
(define (problem world-of-blocks)
	(:domain world-of-blocks)
	(:objects
		a b c d e f g h
	)
	(:init		
		(na-ziemi a)
		(na-ziemi b)
		(na-ziemi c)
		(na-ziemi d)
		(na-ziemi e)
		(na-ziemi f)
		(na-ziemi g)
		(na-ziemi h)
	)
	(:goal
		(and
			(na-ziemi a)
			(na b a)
			(na c b)
			(na d c)
			(na e d)
			(na f e)
			(na g f)
			(na h g)
		)
	)
)

; plan
1. (podnies-z-ziemi b)
   deleted: (na-ziemi b)
   added: (arm b)
   goals met: 1 of 8
2. (opusc-na-paczke b a)
   deleted: (arm b)
   added: (na b a)
   goals met: 2 of 8
3. (podnies-z-ziemi c)
   deleted: (na-ziemi c)
   added: (arm c)
   goals met: 2 of 8
4. (opusc-na-paczke c b)
   deleted: (arm c)
   added: (na c b)
   goals met: 3 of 8
5. (podnies-z-ziemi d)
   deleted: (na-ziemi d)
   added: (arm d)
   goals met: 3 of 8
6. (opusc-na-paczke d c)
   deleted: (arm d)
   added: (na d c)
   goals met: 4 of 8
7. (podnies-z-ziemi e)
   deleted: (na-ziemi e)
   added: (arm e)
   goals met: 4 of 8
8. (opusc-na-paczke e d)
   deleted: (arm e)
   added: (na e d)
   goals met: 5 of 8
9. (podnies-z-ziemi f)
   deleted: (na-ziemi f)
   added: (arm f)
   goals met: 5 of 8
10. (opusc-na-paczke f e)
   deleted: (arm f)
   added: (na f e)
   goals met: 6 of 8
11. (podnies-z-ziemi g)
   deleted: (na-ziemi g)
   added: (arm g)
   goals met: 6 of 8
12. (opusc-na-paczke g f)
   deleted: (arm g)
   added: (na g f)
   goals met: 7 of 8
13. (podnies-z-ziemi h)
   deleted: (na-ziemi h)
   added: (arm h)
   goals met: 7 of 8
14. (opusc-na-paczke h g)
   deleted: (arm h)
   added: (na h g)
   goals met: 8 of 8
